app/views/personagens/show.html.erb

SELECT "poderes".* FROM "poderes" WHERE "poderes"."personagem_id" = ?  [["personagem_id", 1]]
---
     <ul class="list-group" style="margin-top: 25px">
      <% @personagem.poderes.each do |poder| %>